# 属性
#  0:通常,1:太字,4:下線,7:前/背景色の反転,8:非表示
# テキスト配色
#  30:黒,31:赤,32:緑,33:黄,34:青,35:紫,36:シアン,37:灰,38:詳細色指定,39:デフォルト
# 背景配色
#  40:黒,41:赤,42:緑,43:黄,44:青,45:紫,46:シアン,47:灰,48:詳細色指定,49:デフォルト
# 詳細色コード
#  016～255
#
# 設定方法
#  '\e[属性;テキスト配色;背景配色mXXXXX\e[m'
#
# 設定例
#  echo '\e[0;31;44mXXXXX\e[m'           # 通常,赤文字色,青背景色
#  echo '\e[1;38;5;32mXXXXX\e[m'         # 太文字,詳細文字色(32)
#  echo '\e[1;48;5;64mXXXXX\e[m'         # 太文字,詳細背景色(64)
#  echo '\e[4;38;5;32;48;5;64mXXXXX\e[m' # 下線,詳細文字色(32),詳細背景色(64)

# 色見本(テキスト)
function textcolor() {
  for ((i = 0; i < 255; i++)); do
    printf "\e[38;5;%dm %3d# \e[m" $i $i
    if [[ $i%11 -eq 10 ]] then
      printf "\n"
    fi
  done
  echo
}

# 色見本(背景)
function bgcolor() {
  for ((i = 0; i < 255; i++)); do
    printf "\e[48;5;%dm %3d# \e[m" $i $i
    if [[ $i%11 -eq 10 ]] then
      printf "\n"
    fi
  done
  echo
}
